# Математические операции — это базовые действия с числами: 
# сложение, вычитание, умножение, деление и так далее.

# Сложение
# a = 10
# b = 5
# print(a + b)
# print(a + 10)
# print(5 + 5)

# c = a + b + a + 10 + 2 + 30 + 40 + 10 + 19 + 10
# print(c)

# Вычитание
# a = -10
# b = 5
# print(a + -b)
# print(a - 15)
# print(5 - 5)

# print(1 + 2 - 3 + 4 - 5 + 6 - 7 + 8 - 9)

# Произведение
# a = -10
# b = -5
# print(a * b)
# print(a * 10)
# print(5 * 5)

# Деление
# a = -10
# b = -5
# print(a / b)
# print(a / 3)
# print(5 / 5)

# print(2 + 2 * 2)

# Степень
# a = 10
# b = 3
# c = 16
# d = 8
# print(a ** b)
# print(c ** 0.5)
# print(d ** (1/3))

# Целочисленное деление
# a = 15
# b = 4
# print(a / b)
# print(a // b)

# Остаток от деления
# a = 15
# b = 4
# print(a / b)
# print(a % b)

# a = int(input())
# print(a % 2)

a = 12
a %= 1 + 2 + 2
print(a)